{
  "errorRecommendations": {
    "MISSING_REQUIRED_FIELDS": {
      "title": "Incomplete Information",
      "severity": "error",
      "userMessage": "Required customer information is missing to process the payment",
      "description": "The customer did not provide all required data in the payment request",
      "actions": [
        "Ask the customer to complete their information",
        "Verify that the customer has entered name, email and banking details",
        "Restart the payment flow with complete data"
      ],
      "whatToDo": "Make sure your payment form requests and validates all required data before sending the transaction to Yuno. Implement automatic messages for the customer to complete missing information.",
      "estimatedResolutionTime": "Immediate"
    },
    "INVALID_AMOUNT": {
      "title": "Invalid Amount",
      "severity": "error",
      "userMessage": "The payment amount is outside the allowed limits",
      "description": "The customer tried to pay an amount that is not allowed in your configuration",
      "actions": [
        "Check with the customer if the amount is correct",
        "Review your minimum and maximum payment limits",
        "Process the payment with an amount within the allowed range"
      ],
      "whatToDo": "Set up automatic validations in your checkout so the amount is within allowed limits before sending the transaction. Show a clear message to the customer if the amount is invalid.",
      "estimatedResolutionTime": "Immediate"
    },
    "INVALID_CURRENCY": {
      "title": "Unsupported Currency",
      "severity": "error",
      "userMessage": "The payment currency is not configured in your account",
      "description": "Your Yuno account does not have this currency enabled for transactions",
      "actions": [
        "Offer the customer another available currency",
        "Check which currencies you have enabled in your dashboard",
        "Contact Yuno support if you need to enable another currency"
      ],
      "whatToDo": "Only allow currencies enabled in your Yuno account in the checkout currency selector. If you need to enable a new currency, request activation from Yuno support.",
      "estimatedResolutionTime": "1-2 business days if requires change"
    },
    "INVALID_BENEFICIARY_DATA": {
      "title": "Incorrect Recipient Data",
      "severity": "error",
      "userMessage": "The customer's banking data is invalid or incomplete",
      "description": "The customer provided banking information that does not meet requirements",
      "actions": [
        "Contact the customer to verify their banking data",
        "Ask them to confirm: exact name, account number and banking institution",
        "Request the payment again with correct data"
      ],
      "whatToDo": "Implement automatic format and completeness validations for banking data in your form. If the error persists, review the integration and logs to identify missing or incorrect data.",
      "estimatedResolutionTime": "5-10 minutes"
    },
    "INVALID_BANK_ACCOUNT": {
      "title": "Invalid Bank Account",
      "severity": "error",
      "userMessage": "The customer's bank account number is not valid",
      "description": "The provided bank account has an incorrect format",
      "actions": [
        "Contact the customer to confirm their account number",
        "Verify the IBAN, CLABE or account number as appropriate",
        "Request them to confirm directly with their bank if it is correct"
      ],
      "whatToDo": "Automatically validate the account number format before sending the transaction. If the error persists, review the integration and consult with Yuno support.",
      "estimatedResolutionTime": "15-30 minutes"
    },
    "INSUFFICIENT_BALANCE": {
      "title": "Insufficient Balance",
      "severity": "warning",
      "userMessage": "The customer does not have sufficient funds in their account",
      "description": "The customer's bank account does not have balance to cover the payment",
      "actions": [
        "Notify the customer that they need more funds",
        "Offer a smaller amount if possible",
        "Provide alternative payment options or pay later"
      ],
      "whatToDo": "Show an automatic message in checkout indicating that the transaction was declined due to insufficient balance. Allow the customer to try another payment method or smaller amount.",
      "estimatedResolutionTime": "Variable depending on customer"
    },
    "PAYOUT_LIMIT_EXCEEDED": {
      "title": "Transaction Limit Exceeded",
      "severity": "warning",
      "userMessage": "The customer exceeded the maximum allowed payment limit",
      "description": "Your account has configured limits that the customer exceeded",
      "actions": [
        "Offer to process the payment in two or more transactions",
        "Review your transaction limits in the dashboard",
        "Contact Yuno if you need to increase your limits"
      ],
      "whatToDo": "Ensure your system does not allow transactions that exceed configured limits. If you need to increase the limit, request the change from Yuno support.",
      "estimatedResolutionTime": "Depends on your configured limit"
    },
    "DAILY_PAYOUT_LIMIT": {
      "title": "Daily Limit Reached",
      "severity": "warning",
      "userMessage": "You have already processed the maximum payments allowed today",
      "description": "Your account reached the daily transaction limit",
      "actions": [
        "Offer the customer to process the payment tomorrow",
        "Check your daily limit in the dashboard",
        "Contact Yuno if you need to increase your daily capacity"
      ],
      "whatToDo": "Configure your system to automatically reject payments that exceed the daily limit and show a clear message to the customer. If you need to increase the limit, request the change from Yuno support.",
      "estimatedResolutionTime": "Up to 24 hours"
    },
    "PAYOUT_NOT_ENABLED": {
      "title": "Payment Service Not Activated",
      "severity": "error",
      "userMessage": "Your account does not have the payment service enabled",
      "description": "Your Yuno account does not yet have the transfer module activated",
      "actions": [
        "Access your Yuno dashboard",
        "Request activation of the payment service",
        "Complete any additional verification required",
        "Wait for confirmation that the service is active"
      ],
      "whatToDo": "Verify in your Yuno dashboard that the payment service is active before sending transactions. If not active, request activation from Yuno support.",
      "estimatedResolutionTime": "1-3 business days"
    },
    "AUTHORIZATION_REQUIRED": {
      "title": "Security Confirmation Required",
      "severity": "warning",
      "userMessage": "Yuno requests additional confirmation to process the payment",
      "description": "For security reasons, additional verification is required",
      "actions": [
        "Look for the confirmation code in your email or SMS",
        "Complete the requested authentication process",
        "Confirm that your customer can receive verification messages",
        "Restart the payment once confirmed"
      ],
      "whatToDo": "Ensure your payment flow allows completing required authentication (OTP, 2FA, etc). If the customer does not complete authentication, show an automatic message and allow retry.",
      "estimatedResolutionTime": "5-10 minutes"
    },
    "AUTHORIZATION_EXPIRED": {
      "title": "Confirmation Expired",
      "severity": "error",
      "userMessage": "Yuno's confirmation code has expired",
      "description": "The time to confirm the payment has expired",
      "actions": [
        "Request a new confirmation code",
        "Restart the payment process from the beginning",
        "Make sure to confirm within the indicated time"
      ],
      "whatToDo": "Allow the customer to request a new confirmation code from checkout and ensure the flow allows completing authentication within the required time.",
      "estimatedResolutionTime": "Immediate"
    },
    "PROVIDER_DECLINED": {
      "title": "Bank Rejection",
      "severity": "error",
      "userMessage": "The customer's bank rejected the payment",
      "description": "The banking institution did not approve the transaction",
      "actions": [
        "Contact the customer to verify their data is correct",
        "Suggest they try another payment method",
        "Ask them to contact their bank if there are active blocks",
        "Try again in a few minutes"
      ],
      "whatToDo": "Show an automatic message in checkout indicating the bank rejected the transaction. Allow the customer to try another payment method or retry later.",
      "estimatedResolutionTime": "Try after 30-60 minutes"
    },
    "ACCOUNT_CLOSED": {
      "title": "Bank Account Closed",
      "severity": "warning",
      "userMessage": "The customer's bank account has been closed",
      "description": "The banking institution closed the customer's account",
      "actions": [
        "Contact the customer to inform them of the problem",
        "Request they provide an active bank account",
        "Confirm with the customer they have another account available"
      ],
      "whatToDo": "Configure your system to reject payments to closed bank accounts and show an automatic message to the customer requesting a valid account.",
      "estimatedResolutionTime": "Variable"
    },
    "ACCOUNT_BLOCKED": {
      "title": "Blocked Account",
      "severity": "warning",
      "userMessage": "The customer's bank account is blocked",
      "description": "The bank blocked the account and cannot receive transfers",
      "actions": [
        "Notify the customer that their account is blocked",
        "Suggest they contact their bank to unblock it",
        "Offer to process when the account is active again"
      ],
      "whatToDo": "Show an automatic message in checkout indicating the bank account is blocked. Allow the customer to enter another account or try later.",
      "estimatedResolutionTime": "Depends on the customer"
    },
    "RISK_BLOCKED": {
      "title": "Security Block",
      "severity": "critical",
      "userMessage": "Yuno detected a potential risk and blocked the transaction",
      "description": "Yuno's security system blocked the payment",
      "actions": [
        "Do not try to process the same payment again",
        "Contact Yuno support directly",
        "Provide the transaction ID to support",
        "Wait for their review before retrying"
      ],
      "whatToDo": "Do not reprocess the payment automatically. Escalate the case to Yuno support with the transaction ID for security review.",
      "estimatedResolutionTime": "2-4 hours"
    },
    "AML_REJECTED": {
      "title": "Regulatory Rejection",
      "severity": "critical",
      "userMessage": "The payment was rejected due to regulatory validations",
      "description": "Yuno rejected the transaction for anti-money laundering compliance",
      "actions": [
        "Contact Yuno support immediately",
        "Have customer and transaction information ready",
        "Provide documentation requested by the compliance team",
        "Wait for review and resolution from the compliance team"
      ],
      "whatToDo": "Escalate the case to Yuno support with transaction information and follow compliance team instructions before retrying the payment.",
      "estimatedResolutionTime": "3-5 business days"
    },
    "SANCTIONS_MATCH": {
      "title": "Legal Validation Required",
      "severity": "critical",
      "userMessage": "The payment cannot be processed due to legal restrictions",
      "description": "The transaction or customer does not meet legal requirements",
      "actions": [
        "Do not try to force the transaction again",
        "Contact Yuno support immediately",
        "Review that customer data is correct",
        "Wait for Yuno's legal review before continuing"
      ],
      "whatToDo": "Do not reprocess the payment automatically. Escalate the case to Yuno support for legal review and follow their instructions before retrying.",
      "estimatedResolutionTime": "5-10 business days"
    },
    "PROVIDER_TIMEOUT": {
      "title": "Response Time Exceeded",
      "severity": "warning",
      "userMessage": "The bank took longer than expected to respond",
      "description": "The customer's bank did not respond within the allowed time",
      "actions": [
        "Wait 5-10 minutes before retrying",
        "Verify your internet connection is stable",
        "Try the payment again",
        "Contact support if the problem persists"
      ],
      "whatToDo": "Implement automatic retries for this type of error and show a message to the customer indicating the bank is taking time to respond. If the problem persists, check bank status or contact Yuno support.",
      "estimatedResolutionTime": "Try in 5-10 minutes"
    },
    "PROVIDER_UNAVAILABLE": {
      "title": "Bank Service Not Available",
      "severity": "warning",
      "userMessage": "The bank service is not available at this time",
      "description": "The bank is experiencing technical problems or maintenance",
      "actions": [
        "Wait 15-30 minutes before retrying",
        "Check bank status on social media",
        "Try again when the bank normalizes",
        "Offer the customer to process later if urgent"
      ],
      "whatToDo": "Show an automatic message in checkout indicating the bank is not available. Allow the customer to retry later or choose another payment method.",
      "estimatedResolutionTime": "15-60 minutes"
    },
    "INTERNAL_PROCESSING_ERROR": {
      "title": "Processing Error",
      "severity": "error",
      "userMessage": "An internal error occurred while processing the payment",
      "description": "Yuno encountered an internal technical problem",
      "actions": [
        "Try to process the payment again",
        "If the error persists, contact Yuno support",
        "Have transaction and customer information ready",
        "Provide the error ID to the support team"
      ],
      "whatToDo": "Implement automatic retry logic for this error. If the problem persists, escalate the case to Yuno support with the transaction ID and error details.",
      "estimatedResolutionTime": "1-2 hours"
    },
    "RETRY_LIMIT_EXCEEDED": {
      "title": "Too Many Failed Attempts",
      "severity": "error",
      "userMessage": "The retry limit for this payment has been reached",
      "description": "Yuno blocked retries after multiple failures",
      "actions": [
        "Review that all customer data is correct",
        "Wait several hours before processing a new payment",
        "Offer the customer an alternative payment method",
        "Document the error to review what failed"
      ],
      "whatToDo": "Do not reprocess the payment automatically. Configure your system to limit retries and show a message to the customer indicating they must wait before trying again. If the problem continues, escalate to Yuno support.",
      "estimatedResolutionTime": "Minimum 2-4 hours"
    }
  },
  "severityLevels": {
    "info": {
      "color": "#0F7AFF",
      "icon": "info",
      "priority": 1
    },
    "warning": {
      "color": "#FF9500",
      "icon": "warning",
      "priority": 2
    },
    "error": {
      "color": "#FF3B30",
      "icon": "error",
      "priority": 3
    },
    "critical": {
      "color": "#FF1744",
      "icon": "alert",
      "priority": 4
    }
  }
}
